Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionGenerator.GenerateDebug(Tekla.Structures.Filtering.FilterExpression)
Generates the test string expression.
FilterExpression: The Tekla.Structures.Filtering.FilterExpression object to be generated.
Returns: A string containing the filter expression.
Throws System.ArgumentNullException: Thrown when a null FilterExpression is specified.
Throws Tekla.Structures.Filtering.InvalidFilterExpressionException:
Thrown when an invalid FilterExpression is specified.